import pandas as pd
import numpy as np

# ファイルの読み込み
df2024 = '/content/drive/MyDrive/2024data.xls'

# 余計な行の削除
skip_rows = list(range(0, 5)) + list(range(6, 33)) + list(range(86, 91))

df = pd.read_excel(
    df2024,
    skiprows=skip_rows,
    header=0   # ← 残った最初の行をヘッダーに
)

print(df)

# 余計な列の削除
cols_to_drop = [
0,2,3,4,5,8,10,12,14,16,18,20,22,24,
26,28,30,32,34,36,38,40,42,44,46,48,50,
52,54,56,58,60,62,64,66,74
]

df = df.drop(df.columns[cols_to_drop], axis=1)

print(df)


# ヘッダーのリネーム
new_columns = ["県庁所在市等名", "魚介類", "生鮮魚介", "鮮魚", "まぐろ", "あじ", "いわし", "かつお", "かれい", "さけ", "さば", "さんま", "たい", "ぶり", "いか", "たこ", "えび", "かに", "他の鮮魚", "さしみ盛合わせ", "貝類", "あさり", "しじみ", "かき（貝）", "ほたて貝", "他の貝", "塩干魚介", "塩さけ", "たらこ", "しらす干し", "干しあじ", "他の塩干魚介", "魚肉練製品", "揚げかまぼこ", "ちくわ", "かまぼこ", "他の魚肉練製品", "他の魚介加工品", "かつお節・削り節", "魚介の漬物", "魚介の佃煮", "魚介の缶詰", "他の魚介加工品のその他"]

df.columns = new_columns


# 編集したデータフレームの表示
display(df)



# ===================================================================
# ここまでのデータの前処理を関数化して、各年のデータに適用して処理する
# 関数の作成
def clean_fish_data(filepath):

    skip_rows = list(range(0, 5)) + list(range(6, 33)) + list(range(86, 91))

    df = pd.read_excel(
        filepath,
        skiprows=skip_rows,
        header=0
    )

    cols_to_drop = [
        0,2,3,4,5,8,10,12,14,16,18,20,22,24,
        26,28,30,32,34,36,38,40,42,44,46,48,50,
        52,54,56,58,60,62,64,66,74
    ]

    df = df.drop(df.columns[cols_to_drop], axis=1)

    new_columns = [
        "県庁所在市等名","魚介類","生鮮魚介","鮮魚","まぐろ","あじ","いわし",
        "かつお","かれい","さけ","さば","さんま","たい","ぶり","いか",
        "たこ","えび","かに","他の鮮魚","さしみ盛合わせ","貝類","あさり",
        "しじみ","かき（貝）","ほたて貝","他の貝","塩干魚介","塩さけ",
        "たらこ","しらす干し","干しあじ","他の塩干魚介","魚肉練製品",
        "揚げかまぼこ","ちくわ","かまぼこ","他の魚肉練製品","他の魚介加工品",
        "かつお節・削り節","魚介の漬物","魚介の佃煮","魚介の缶詰",
        "他の魚介加工品のその他"
    ]

    df.columns = new_columns

    return df


# 2024年のデータを処理
df2024 = clean_fish_data('/content/drive/MyDrive/2024data.xls')

# 2023年のデータを処理
df2023 = clean_fish_data('')

# 2022年のデータを処理
df2022 = clean_fish_data('')

# 2021年のデータを処理
df2021 = clean_fish_data('')

# 2020年のデータを処理
df2020 = clean_fish_data('')
